# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

network = input('Введите адрес в формате: 10.1.1.0/24: ')
octets = network.split('/')[0].split('.')
mask = network.split('/')[1]
mask_2 = "1" * int(mask) + "0" * 4
ip_template = '''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}

Mask:
/{4:<8}
{9:<8} {10:<8} {11:<8} {12:<8} 
{5:08} {6:08} {7:08} {8:08}
'''

print(ip_template.format(int(octets[0]), int(octets[1]), int(octets[2]), int(octets[3]), int(mask), int(mask_2[0:8]), int(mask_2[8:16]), int(mask_2[16:24]), int(mask_2[24:34]), int(mask_2[0:8], 2), int(mask_2[8:16], 2), int(mask_2[16:24], 2), int(mask_2[24:34], 2)))
